phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
/*
 * Phoenix-RTOS
 *
 * i.MX RT Flash server
 *
 * Copyright 2019-2023 Phoenix Systems
 * Author: Hubert Buczynski, Gerard Swiderski
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */

#include <endian.h>
#include <errno.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <sys/msg.h>
#include <sys/file.h>
#include <sys/threads.h>
#include <posix/utils.h>

#include <meterfs.h>
#include <ptable.h>
#include <board_config.h>

#include "fspi.h"
#include "flashdrv.h"
#include "imxrt-flashsrv.h"


/* clang-format off */
#define LOG_ERROR(str, ...) do { fprintf(stderr, __FILE__  ":%d error: " str "\n", __LINE__, ##__VA_ARGS__); } while (0)
#define TRACE(str, ...) do { if (0) fprintf(stderr, __FILE__  ":%d trace: " str "\n", __LINE__, ##__VA_ARGS__); } while (0)
/* clang-format on */

#define METERFS_STACKSZ   1024
#define THREAD_STACKSZ    1024
#define FLASH_MEMORIES_NO (FLEXSPI_COUNT)

#ifndef IMXRT_FLASH_PRIO
/*
 * Threads/processes including and below this priority must be run only from RAM to avoid preempting imxrt-flash
 * during write to flash, threads/processes above that priority shall be run either from XIP or RAM.
 */
#define IMXRT_FLASH_PRIO 3
#endif

#define CRC32_BUFSZ 256

/* clang-format off */
enum { flashsrv_memory_inactive = 0, flashsrv_memory_active = 0xff };
/* clang-format on */

typedef struct {
	ptable_part_t *pHeader;

	oid_t oid;
	uint8_t fID;
	uint8_t pStatus;

	void *fsCtx;
} flashsrv_partition_t;


typedef struct {
	flash_context_t ctx;
	flashsrv_partition_t *parts;

	uint32_t pCnt;
	uint8_t fStatus;
	uint8_t currPart;
	uint8_t rawActive;

	oid_t fOid;
	uint32_t rawPort;

	handle_t lock;
} flashsrv_memory_t;


static struct {
	flashsrv_memory_t flash_memories[FLASH_MEMORIES_NO];
	uint32_t flexspi_addresses[FLASH_MEMORIES_NO];
	flashsrv_partitionOps_t ops;
} flashsrv_common;


/* Flash functions */

static int flashsrv_getFlashMemory(uint8_t fID, flashsrv_memory_t **pFlashMemory)
{
	flashsrv_memory_t *mem;

	if (FLASH_MEMORIES_NO <= fID) {
		return -EINVAL;
	}

	mem = flashsrv_common.flash_memories + fID;

	if (mem->fStatus == flashsrv_memory_inactive) {
		return -ENODEV;
	}

	*pFlashMemory = mem;

	return EOK;
}

/* Buffered access */

static ssize_t flashsrv_bufferedWrite(uint8_t fID, size_t offset, const void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_bufferedWrite(&mem->ctx, offset, data, size) : res;
}


static ssize_t flashsrv_bufferedRead(uint8_t fID, size_t offset, void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_bufferedRead(&mem->ctx, offset, data, size) : res;
}


static ssize_t flashsrv_bufferedSync(uint8_t fID)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_sync(&mem->ctx) : res;
}


/* Direct access */

static ssize_t flashsrv_directWrite(uint8_t fID, size_t offset, const void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_directWrite(&mem->ctx, offset, data, size) : res;
}


static ssize_t flashsrv_directRead(uint8_t fID, size_t offset, void *data, size_t size)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_directRead(&mem->ctx, offset, data, size) : res;
}


static int flashsrv_eraseSector(uint8_t fID, size_t offs)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_sectorErase(&mem->ctx, offs) : res;
}


static int flashsrv_chipErase(uint8_t fID)
{
	flashsrv_memory_t *mem;
	int res = flashsrv_getFlashMemory(fID, &mem);
	return (res == EOK) ? flash_chipErase(&mem->ctx) : res;
}


static uint32_t flashsrv_crc32Update(uint32_t crc32, const uint8_t *data, size_t len)
{
	unsigned int i;

	while (len--) {
		crc32 ^= *data++;
		for (i = 0; i < 8; i++) {
			crc32 = (crc32 >> 1) ^ ((crc32 & 1) ? 0xedb88320 : 0);
		}
	}

	return crc32;
}


static int flashsrv_calcCrc32(uint8_t fID, size_t offset, size_t len, uint32_t *crc32)
{
	flashsrv_memory_t *mem;
	uint8_t buf[CRC32_BUFSZ];
	uint32_t tmp;
	int res;

	res = flashsrv_getFlashMemory(fID, &mem);
	if (res < 0) {
		return res;
	}

	/* caller should set crc32 to base */
	tmp = *crc32;

	while (len > 0) {
		res = flash_directRead(&mem->ctx, offset, buf, len < sizeof(buf) ? len : sizeof(buf));
		if (res < 0) {
			return res;
		}

		tmp = flashsrv_crc32Update(tmp, buf, res);

		offset += res;
		len -= res;
	}

	*crc32 = tmp;

	return EOK;
}


/* Callbacks to meterfs - wrappers for basic flash functions */

static ssize_t flashsrv_fsWritef0(struct _meterfs_devCtx_t *devCtx, off_t offs, const void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directWrite(0, offs, buff, bufflen);
}


static ssize_t flashsrv_fsWritef1(struct _meterfs_devCtx_t *devCtx, off_t offs, const void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directWrite(1, offs, buff, bufflen);
}


static ssize_t flashsrv_fsReadf0(struct _meterfs_devCtx_t *devCtx, off_t offs, void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directRead(0, offs, buff, bufflen);
}


static ssize_t flashsrv_fsReadf1(struct _meterfs_devCtx_t *devCtx, off_t offs, void *buff, size_t bufflen)
{
	(void)devCtx;

	return flashsrv_directRead(1, offs, buff, bufflen);
}


static int flashsrv_fsEraseSectorf0(struct _meterfs_devCtx_t *devCtx, off_t offs)
{
	(void)devCtx;

	return flashsrv_eraseSector(0, offs);
}


static int flashsrv_fsEraseSectorf1(struct _meterfs_devCtx_t *devCtx, off_t offs)
{
	(void)devCtx;

	return flashsrv_eraseSector(1, offs);
}


static void flashsrv_devCtl(flashsrv_memory_t *memory, msg_t *msg)
{
	uint8_t fID;
	uint32_t crc32;
	flash_i_devctl_t *idevctl = (flash_i_devctl_t *)msg->i.raw;
	flash_o_devctl_t *odevctl = (flash_o_devctl_t *)msg->o.raw;

	if (memory == NULL) {
		msg->o.err = -EINVAL;
		return;
	}

	fID = msg->oid.id;
	if (fID >= FLASH_MEMORIES_NO) {
		msg->o.err = -EINVAL;
		return;
	}

	switch (idevctl->type) {
		case flashsrv_devctl_properties:
			TRACE("imxrt-flashsrv: flashsrv_devctl_properties, id: %u, port: %u.", msg->oid.id, msg->oid.port);
			odevctl->properties.size = memory->ctx.properties.size;
			odevctl->properties.psize = memory->ctx.properties.page_size;
			odevctl->properties.ssize = memory->ctx.properties.sector_size;
			odevctl->properties.offs = 0;
			msg->o.err = EOK;
			break;

