phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
			res = create_dev(&part->oid, path);
			if (res < 0) {
				LOG_ERROR("imxrt-flashsrv: create %s - err: %d", path, res);
				return res;
			}

			if (!flashsrv_common.flash_memories[part->fID].rawActive) {
				flashsrv_common.flash_memories[part->fID].rawActive = 1;

				mem = malloc(THREAD_STACKSZ);
				if (mem == NULL) {
					LOG_ERROR("imxrt-flashsrv: cannot alloc memory.");
					return -ENOMEM;
				}

				beginthread(flashsrv_rawThread, IMXRT_FLASH_PRIO, mem, THREAD_STACKSZ, (void *)&flashsrv_common.flash_memories[part->fID]);
			}
			part->pStatus = flashsrv_memory_active;
			break;

		/* Each meterfs partition is handled by separate thread */
		case ptable_meterfs:
			res = flashsrv_initMeterfs(part);
			if (res < 0) {
				return res;
			}

			res = portCreate(&part->oid.port);
			if (res < 0) {
				LOG_ERROR("imxrt-flashsrv: portCreate %s - err: %d", path, res);
				return res;
			}

			res = create_dev(&part->oid, path);
			if (res < 0) {
				LOG_ERROR("imxrt-flashsrv: create_dev %s - err: %d", path, res);
				return res;
			}

			mem = malloc(METERFS_STACKSZ);
			if (mem == NULL) {
				LOG_ERROR("imxrt-flashsrv: cannot alloc memory.");
				return -ENOMEM;
			}

			beginthread(flashsrv_meterfsThread, IMXRT_FLASH_PRIO, mem, METERFS_STACKSZ, (void *)part);
			part->pStatus = flashsrv_memory_active;
			break;

		default:
			res = -EINVAL;
			break;
	}

	return res;
}


static ptable_t *flashsrv_ptableRead(flashsrv_memory_t *memory)
{
	ptable_t *ptable;
	uint32_t offs, count, size;
	uint8_t magic[sizeof(ptable_magic)];

	/* Read number of partitions */
	offs = memory->ctx.properties.size - memory->ctx.properties.sector_size;
	if (flash_directRead(&memory->ctx, offs, &count, sizeof(count)) != sizeof(count)) {
		return NULL;
	}
	count = le32toh(count);

	/* Verify partition table size */
	size = ptable_size(count);
	if (size > memory->ctx.properties.sector_size) {
		return NULL;
	}

	/* Read magic signature */
	if (flash_directRead(&memory->ctx, offs + size - sizeof(magic), magic, sizeof(magic)) != sizeof(magic)) {
		return NULL;
	}

	/* Verify magic signature */
	if (memcmp(magic, ptable_magic, sizeof(magic)) != 0) {
		return NULL;
	}

	ptable = malloc(size);
	if (ptable == NULL) {
		return NULL;
	}

	if (flash_directRead(&memory->ctx, offs, ptable, size) != size) {
		free(ptable);
		return NULL;
	}

	if (ptable_deserialize(ptable, memory->ctx.properties.size, memory->ctx.properties.sector_size) < 0) {
		free(ptable);
		return NULL;
	}

	return ptable;
}


static int flashsrv_partsInit(void)
{
	int res, i, j;

	flashsrv_memory_t *memory;
	ptable_t *ptable;

	for (i = 0; i < FLASH_MEMORIES_NO; ++i) {
		memory = flashsrv_common.flash_memories + i;
		if (memory->fStatus != flashsrv_memory_active) {
			continue;
		}

		/* Read partition table */
		ptable = flashsrv_ptableRead(memory);
		if (ptable == NULL) {
			LOG_ERROR("imxrt-flashsrv: cannot initialize partition table on flash %d, wrong attributes", i);
			continue;
		}

		memory->pCnt = ptable->count;
		memory->parts = calloc(memory->pCnt, sizeof(flashsrv_partition_t));
		if (memory->parts == NULL) {
			LOG_ERROR("imxrt-flashsrv: cannot allocate memory.");
			free(ptable);
			return -ENOMEM;
		}

		/* Initialize partitions */
		for (j = 0; j < memory->pCnt; ++j) {
			memory->parts[j].fID = i;
			memory->parts[j].oid.id = j;
			memory->parts[j].pHeader = ptable->parts + j;

			if (flashsrv_mountPart(&memory->parts[j]) < 0) {
				LOG_ERROR("imxrt-flashsrv: partition %s at flash %d is not mounted.", ptable->parts[j].name, i);
				memory->parts[j].pStatus = flashsrv_memory_inactive;
				free(memory->parts[j].fsCtx);
			}
		}

		res = flash_sync(&memory->ctx);
		if (res < 0) {
			return res;
		}
	}

	return EOK;
}


static int flashsrv_flashMemoriesInit(void)
{
	char path[32];
	int i, err = EOK;
	oid_t odir = { 0 };

	flashsrv_memory_t *memory;

	flashsrv_common.flexspi_addresses[0] = FLASH_EXT_DATA_ADDRESS;
	if (FLASH_MEMORIES_NO > 1) {
		flashsrv_common.flexspi_addresses[1] = FLASH_INTERNAL_DATA_ADDRESS;
	}

	/* Wait on root */
	while (lookup("/", NULL, &odir) < 0) {
		usleep(100000);
	}

	/* Initialize flash memories */
	for (i = 0; i < FLASH_MEMORIES_NO; ++i) {
		memory = flashsrv_common.flash_memories + i;

		if (mutexCreate(&memory->lock) != EOK) {
			return -ENOENT;
		}

		memory->fOid.id = i;
		snprintf(path, sizeof(path), "/dev/flash%d", memory->fOid.id);

		err = portCreate(&memory->fOid.port);
		if (err < 0) {
			LOG_ERROR("imxrt-flashsrv: portCreate %s - err: %d", path, err);
			return err;
		}

		err = portCreate(&memory->rawPort);
		if (err < 0) {
			LOG_ERROR("imxrt-flashsrv: portCreate %s.raw - err: %d", path, err);
			return err;
		}

		memory->rawActive = 0;
		memory->pCnt = 0;

		err = create_dev(&memory->fOid, path);
		if (err < 0) {
			LOG_ERROR("imxrt-flashsrv: create_dev %s - err: %d", path, err);
			return err;
		}

		memory->ctx.address = flashsrv_common.flexspi_addresses[i];

		err = flash_init(&memory->ctx);
		if (err == EOK) {
			memory->fStatus = flashsrv_memory_active;
		}
		else {
			memory->fStatus = flashsrv_memory_inactive;
			LOG_ERROR("imxrt-flashsrv: %s - has not been initialized correctly, err: %d.", path, err);
		}
	}

	return EOK;
}


static inline int isXIP(void *addr)
{
	uint32_t pc;
	__asm__ volatile("mov %0, pc"
					 : "=r"(pc));
	return pc >= (uint32_t)addr && pc < (uint32_t)addr + 0x10000000;
}


static int flashsrv_getProperties(uint8_t fID, flashsrv_properties_t *p)
{
	flashsrv_memory_t *mem;

	int res = flashsrv_getFlashMemory(fID, &mem);
	if (res == EOK) {
		mutexLock(mem->lock);
		p->size = mem->ctx.properties.size;
		p->psize = mem->ctx.properties.page_size;
		p->ssize = mem->ctx.properties.sector_size;
		p->offs = 0;
		mutexUnlock(mem->lock);
	}
	return res;
}


static int flashsrv_safeCalcCrc32(uint8_t fID, size_t offset, size_t len, uint32_t *crc32)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_calcCrc32(fID, offset, len, crc32);
	mutexUnlock(mem->lock);

	return ret;
}


static ssize_t flashsrv_safeDirectWrite(uint8_t fID, size_t offset, const void *data, size_t size)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_directWrite(fID, offset, data, size);
	mutexUnlock(mem->lock);
	return ret;
}


static ssize_t flashsrv_safeDirectRead(uint8_t fID, size_t offset, void *data, size_t size)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_directRead(fID, offset, data, size);
	mutexUnlock(mem->lock);
	return ret;
}


