phoenix-rtos/phoenix-rtos-devices/storage/imxrt-flash/flashsrv.c
static int flashsrv_safeSectorErase(uint8_t fID, size_t offs)
{
	ssize_t ret;
	flashsrv_memory_t *mem;

	ret = flashsrv_getFlashMemory(fID, &mem);
	if (ret < 0) {
		return ret;
	}

	mutexLock(mem->lock);
	ret = flashsrv_eraseSector(fID, offs);
	mutexUnlock(mem->lock);
	return ret;
}


__attribute__((weak)) int flashsrv_customIntInit(flashsrv_partitionOps_t *ops)
{
	return EOK;
};


static int flashsrv_customInit(void)
{
	flashsrv_common.ops.read = flashsrv_safeDirectRead;
	flashsrv_common.ops.write = flashsrv_safeDirectWrite;
	flashsrv_common.ops.eraseSector = flashsrv_safeSectorErase;
	flashsrv_common.ops.getProperties = flashsrv_getProperties;
	flashsrv_common.ops.calcCrc32 = flashsrv_safeCalcCrc32;

	return flashsrv_customIntInit(&flashsrv_common.ops);
}


int main(void)
{
	void *mem;

	if (isXIP((void *)FLEXSPI1_AHB_ADDR) || (FLASH_MEMORIES_NO > 1 && isXIP((void *)FLEXSPI2_AHB_ADDR))) {
		LOG_ERROR("imxrt-flashsrv: require to run driver from ram.\n");
		return EXIT_FAILURE;
	}

	priority(IMXRT_FLASH_PRIO);

	if (flashsrv_flashMemoriesInit() != EOK) {
		LOG_ERROR("imxrt-flashsrv: flash memories were not initialized correctly.\n");
		return EXIT_FAILURE;
	}

	if (flashsrv_partsInit() != EOK) {
		LOG_ERROR("imxrt-flashsrv: partitions were not initialized correctly.\n");
		return EXIT_FAILURE;
	}

	if (flashsrv_customInit() < 0) {
		LOG_ERROR("imxrt-flashsrv: custom init failed.\n");
	}

	printf("imxrt-flashsrv: initialized.\n");

	/* flashsrv_devThread handles requests associated with the whole single flash chip */
	if (FLASH_MEMORIES_NO > 1 && flashsrv_common.flash_memories[1].fStatus == flashsrv_memory_active) {
		mem = malloc(THREAD_STACKSZ);
		if (mem == NULL) {
			LOG_ERROR("imxrt-flashsrv: cannot alloc memory.");
			return EXIT_FAILURE;
		}
		beginthread(flashsrv_devThread, IMXRT_FLASH_PRIO, mem, THREAD_STACKSZ, (void *)&flashsrv_common.flash_memories[0]);
		flashsrv_devThread(&flashsrv_common.flash_memories[1]);
	}
	else if (flashsrv_common.flash_memories[0].fStatus == flashsrv_memory_active) {
		flashsrv_devThread(&flashsrv_common.flash_memories[0]);
	}
	else {
		printf("imxrt-flashsrv: end\n");
	}


	return EXIT_SUCCESS;
}
